app/Controllers/MyPet.php

SELECT *
FROM `MyPet`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new MyPetModel();

        $data['MyPet_detail'] = $model->orderBy('id', 'DESC')->findAll();